package GinkgoStack.P24_Enterprise.Tencent;

/**
 * 腾讯2017暑期实习生编程题00:06:06
 * 2/3
 * [编程题]算法基础-字符移位
 * 时间限制：C/C++ 1秒，其他语言2秒
 *
 * 空间限制：C/C++ 32M，其他语言64M
 *
 * 小Q最近遇到了一个难题：把一个字符串的大写字母放到字符串的后面，
 * 各个字符的相对位置不变，且不能申请额外的空间。
 * 你能帮帮小Q吗？
 *
 *
 * 输入描述:
 *
 * 输入数据有多组，每组包含一个字符串s，且保证:1<=s.length<=1000.
 *
 *
 *
 * 输出描述:
 *
 * 对于每组数据，输出移位后的字符串。
 *
 *
 * 输入例子1:
 * AkleBiCeilD
 *
 * 输出例子1:
 * kleieilABCD
 */
public class MoveCharacter {

    /**
     * 取巧的办法，走两遍，第一遍输出小写字符，第二遍输出大写字符
     */

    /**
     * 用一个tmp,从后往前遍历，遇到大写字符就交换移动到小写字符之后。
     */
}
