package GinkgoStack.P12_Math;

/**
 * 剑指 Offer 14- II. 剪绳子 II
 * 给你一根长度为 n 的绳子，请把绳子剪成整数长度的 m 段（m、n都是整数，n>1并且m>1），
 * 每段绳子的长度记为 k[0],k[1]...k[m - 1] 。请问 k[0]*k[1]*...*k[m - 1] 可能的最大乘积是多少？
 * 例如，当绳子的长度是8时，我们把它剪成长度分别为2、3、3的三段，此时得到的最大乘积是18。
 *
 * 答案需要取模 1e9+7（1000000007），如计算初始结果为：1000000008，请返回 1。
 *
 *
 *
 * 示例 1：
 *
 * 输入: 2
 * 输出: 1
 * 解释: 2 = 1 + 1, 1 × 1 = 1
 * 示例 2:
 *
 * 输入: 10
 * 输出: 36
 * 解释: 10 = 3 + 3 + 4, 3 × 3 × 4 = 36
 *
 *
 * 提示：
 *
 * 2 <= n <= 1000
 */
public class CutRopeLargestProductII {

    /**
     * 此题与 面试题14- I. 剪绳子 主体等价，唯一不同在于本题目涉及 “大数越界情况下的求余问题” 。
     * n的取值范围更大了些：2 <= n <= 1000
     *
     */
    class Solution {
        public int cuttingRope(int n) {
            if(n <= 3)
                return n - 1;
            int b = n % 3, p = 1000000007;

            long rem = 1, x = 3;

            //快速幂求余
            //注意a =  n / 3 - 1,要减去1，因为后面得根据b来具体决定最优解
            for(int a = n / 3 - 1; a > 0; a /= 2) {
                if(a % 2 == 1) rem = (rem * x) % p;
                x = (x * x) % p;
            }

            if(b == 0) //刚好整除
                return (int)(rem * 3 % p);

            if(b == 1) //余1，3+1 变成2*2
                return (int)(rem * 4 % p);

            //余2，那就是3*2
            return (int)(rem * 6 % p);
        }
    }

}
