package GinkgoStack.P24_Enterprise.alibaba;

/**
 * 7.27 第二题 JAVA
 * 有个藏宝架有n层，每层的宝物数量不一，每个宝物都有其价值，
 * 现在要求拿出m个宝物，并且需要遵守规则：
 * 每次只能拿选定层的两端的宝物
 * 要拿出的m个宝物的总价值是各种方案里最大的
 * 输入： n m
 * 下面每行代表每层，且第一个数是这层宝物的数量k，后面的则是k个宝物的价值
 * 4 1 2 4 5
 * 5 1 2 4 5 5
 * 样例：
 * 2 3
 * 2 3 2
 * 4 1 4 1 5
 * 输出：5+3+2=10
 */
public class SelectedTreasures {

    /**
     * 感觉是不是楼主记错了题目描述
     * 如果按照这个题目描述
     * 这不就是一个排序题吗？
     */

    /**
     * 他用了DP
     * https://blog.nowcoder.net/n/8a1bc34616b34973bc746aa572171f5c
     */
}
